/******************************************************************************
**                           南京安杰信息科技有限公司
**
**                           http://www.njanjar.com
**
**--------------基本文件信息---------------------------------------------------
** 文   件   名: handle_timer.c
** 创   建   人: 宋志康
** 版        本: V0.3
** 最后修改日期: 2016-08-30
** 描        述: 处理定时器溢出
** 编        译: xc8
** 硬        件: aj-b-dk-g-v3 2016-6-23
**
**--------------历史版本信息---------------------------------------------------
** 创   建   人: 宋志康
** 版  	     本: V0.2
** 日　      期: 2016-05-31
** 描　      述: aj-b-dk-g-v2 2015-10-21

** 修   订   人 : 
** 版  	     本 : 
** 修订    日期 : 
** 描　      述 : 
**-----------------------------------------------------------------------------
*******************************************************************************/

//**--------------头文件-------------------------------------------------------
#include <xc.h>
#include <GenericTypeDefs.h>

#include "led.h"
#include "24c02.h"
#include "handle_floor.h"
#include "handle_ic_card.h"

//**--------------全局变量-----------------------------------------------------
WORD timer_count = 0x00;
BYTE flag_timer = 0x00;
BYTE user_card_count = 0x00;

//**--------------函数申明-----------------------------------------------------
void
handle_timer(
	void
	)
{
	if (is_enable)
	{
		LED1_TOG; // 梯控启动心跳指示灯
	}
	else
	{
		
	}
	
	if (flag_user_card)
	{
		user_card_count++;
		if (user_card_count >= 0x08)
		{
			user_card_count = 0x00;
			flag_user_card = 0x00;
			RB4 = 0x01; // 414的5，6和7，8脚断开，所有按键不可按
			RB5 = 0x01;
		}
	}
}
