/******************************************************************************
**                           南京安杰信息科技有限公司
**
**                           http://www.njanjar.com
**
**--------------基本文件信息---------------------------------------------------
** 文   件   名: handle_rs485.h
** 创   建   人: 宋志康
** 版        本: V0.2
** 最后修改日期: 2016-05-31
** 描        述: 处理rs485接收数据
**
**--------------历史版本信息---------------------------------------------------
** 创   建   人: 宋志康
** 版  	     本: V0.2
** 日　      期: 2016-05-31
** 描　      述: 处理rs485接收数据

** 修   订   人 : 
** 版  	     本 : 
** 修订    日期 : 
** 描　      述 : 
**-----------------------------------------------------------------------------
*******************************************************************************/
#ifndef _AJ_HANDLE_RS485_H
#define _AJ_HANDLE_RS485_H

//**--------------包含文件-----------------------------------------------------

//**--------------宏定义-------------------------------------------------------
#define CMD_GET_RECORD			0xB1 // 获得刷卡记录
#define CMD_REPORT_THE_LOSS		0xB3 // 挂失卡号
#define CMD_FIRE				0xB4 // 消防

#define P_H_R 0xF0 	// 请求包头（群控器发送，读卡器接收）
#define P_T_R 0xF1 	// 请求包尾（群控器发送，读卡器接收）

#define P_H_A 0xF2	// 请求包头（读卡器发送，群控器接收）
#define P_T_A 0xF3	// 请求包尾（读卡器发送，群控器接收）



//**--------------数据结构-----------------------------------------------------

//**--------------函数申明-----------------------------------------------------
void
handle_rs485(
	void
	); // 处理rs485接收数据

//**--------------全局变量-----------------------------------------------------
extern BYTE uart2_receive_buffer[16]; // uart2接收数据缓冲区
extern BYTE uart2_cnt; // uart2接收数据计数
extern BYTE flag_uart2_cmd; // uart2接收数据完成标志
extern BYTE count_uart2_receive;

#endif // _AJ_HANDLE_RS485_H
